app/controllers/instituicoes_controller.rb

SELECT "instituicaos".* FROM "instituicaos"
---
  def index
    @instituicoes = Instituicao.all