app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("cnpj", "created_at", "email", "endereco", "nome_da_empresa", "telefone", "tipo_de_negocio", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @usuario = Usuario.new( usuario_params)

    @usuario.save

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = ? LIMIT 1  [["id", 11]]
---
  def created
    @usuario = Usuario.find(params[:id])